! ========================================================== 
! GymLink ACL Configuration File
! Author: Pedro Gaetjens Molongua 
! Device: Main Router 
! Purpose: FireWall Configuration Using Cisco IOS Commands 
! ==========================================================
!
! ------------------------------------------------------------------
! 1. STANDARD ACLS FOR INTER-VLAN TRAFFIC CONTROL (DENY/PERMIT)
!    These ACLs are applied INBOUND on the respective router sub-interfaces.
! ------------------------------------------------------------------

! --- ACL 100: Staff (VLAN 20) Traffic Control ---
! Deny Staff (20) access to Management (10) and IT (40). Allow all other traffic.
Router(config)# access-list 100 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
Router(config)# access-list 100 deny ip 192.168.20.0 0.0.0.255 192.168.40.0 0.0.0.255
Router(config)# access-list 100 permit ip 192.168.20.0 0.0.0.255 any

! --- ACL 110: Customer Service (VLAN 30) Traffic Control ---
! Deny Customer Service (30) access to Management (10) and IT (40). Allow all other traffic.
Router(config)# access-list 110 deny ip 192.168.30.0 0.0.0.255 192.168.10.0 0.0.0.255
Router(config)# access-list 110 deny ip 192.168.30.0 0.0.0.255 192.168.40.0 0.0.0.255
Router(config)# access-list 110 permit ip 192.168.30.0 0.0.0.255 any

! --- ACL 120: Management (VLAN 10) Traffic Control ---
! Management is the most privileged; permit all traffic from this source.
Router(config)# access-list 120 permit ip 192.168.10.0 0.0.0.255 any

! --- ACL 130: IT (VLAN 40) Traffic Control ---
! Deny IT (40) access only to Management (10). IT still needs access to other services.
Router(config)# access-list 130 deny ip 192.168.40.0 0.0.0.255 192.168.10.0 0.0.0.255
Router(config)# access-list 130 permit ip 192.168.40.0 0.0.0.255 any

! ------------------------------------------------------------------
! 2. GUEST VLAN ISOLATION (ACL 140)
!    Guest traffic (VLAN 50) is strictly denied access to ALL internal staff/management VLANs.
! ------------------------------------------------------------------

Router(config)# access-list 140 deny ip 192.168.50.0 0.0.0.255 192.168.10.0 0.0.0.255
Router(config)# access-list 140 deny ip 192.168.50.0 0.0.0.255 192.168.20.0 0.0.0.255
Router(config)# access-list 140 deny ip 192.168.50.0 0.0.0.255 192.168.30.0 0.0.0.255
Router(config)# access-list 140 deny ip 192.168.50.0 0.0.0.255 192.168.40.0 0.0.0.255
Router(config)# access-list 140 permit ip 192.168.50.0 0.0.0.255 any

! ------------------------------------------------------------------
! 3. APPLICATION OF STANDARD ACLS TO ROUTER SUB-INTERFACES
! ------------------------------------------------------------------

Router(config)# interface GigabitEthernet0/0.10
Router(config-subif)# ip access-group 120 in
Router(config-subif)# exit

Router(config)# interface GigabitEthernet0/0.20
Router(config-subif)# ip access-group 100 in
Router(config-subif)# exit

Router(config)# interface GigabitEthernet0/0.30
Router(config-subif)# ip access-group 110 in
Router(config-subif)# exit

Router(config)# interface GigabitEthernet0/0.40
Router(config-subif)# ip access-group 130 in
Router(config-subif)# exit

Router(config)# interface GigabitEthernet0/0.50
Router(config-subif)# ip access-group 140 in
Router(config-subif)# exit

! ------------------------------------------------------------------
! 4. EXTENDED ACL FOR EXTERNAL FIREWALL SIMULATION
!    (BLOCK_PRIVATE_IN applied to external interface Gi0/1 INBOUND)
! ------------------------------------------------------------------

Router(config)# ip access-list extended BLOCK_PRIVATE_IN
! Deny standard private IP ranges from entering the network (Anti-Spoofing/Firewall)
Router(config-ext-nacl)# deny ip 10.0.0.0 0.255.255.255 any
Router(config-ext-nacl)# deny ip 172.16.0.0 0.15.255.255 any
Router(config-ext-nacl)# deny ip 192.168.0.0 0.0.255.255 any
! Explicitly permit all other traffic
Router(config-ext-nacl)# permit ip any any
Router(config-ext-nacl)# exit

! Apply the firewall ACL to the external (WAN) interface
Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip access-group BLOCK_PRIVATE_IN in
Router(config-if)# exit

! ------------------------------------------------------------------
! Verification Command:
! Router# show access-lists
! ------------------------------------------------------------------
!
! --- END ACL CONFIGURATION ---
!
